README.org
#+TITLE: Installing Guix on openSUSE MicroOS
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

[[https://raw.githack.com/CuBeRJAN/microos-guix/main/README.html][Click here for the HTML version]]

* Introduction
I have recently decided to move my desktop to an immutable system, more specifically openSUSE's MicroOS.

Since MicroOS doesn't use a traditional package manager like ~apt~ or ~zypper~, it's necessary to use containerised or otherwise distribution-independent solutions for installing packages.
The usual approach is using ~flatpak~ for GUI applications, and ~distrobox~ to create containers for CLI utilities and wherever else it is needed.

I personally have multiple issues with using containers:
- They aren't transactionally updated - my containerized system can still break and cause trouble, even if limited just to the container this is still troublesome in my opinion.
- The tooling is somewhat lacking in my opinion - for example exporting binaries from a container is a little awkward.

The solution? [[https://guix.gnu.org/][Guix]].

Guix allows for easy installations of software on MicroOS - there is little difference in usage compared to, say, ~apt~.

However, using Guix on MicroOS has proven itself a difficult task - so I've decided to outline the steps for anyone looking to do the same.

* Notes
- Unfortunately it is currently not possible to use Guix with SELinux - for that reason SELinux will be set to ~permissive~ mode. This has certain security implications - I'm not a security expert so you are free to do your own research for what these are.
  - I'll say that from what I've seen the general consensus seems that using ~permissive~ is /acceptable/ on a desktop.
- I know Nix can be used for the same purpose, but I personally prefer Guix and have more experience with it.

* Installation
Let's get into the actual installation steps.

** Prepare subvolume
We will first need to create a ~btrfs~ subvolume for the ~/gnu~ directory. First let's find the system drive's name - this can be done using the command ~lsblk~.

Here is an example of what the output of this command can look like:
#+BEGIN_SRC sh
nvme0n1     259:0    0 476,9G  0 disk 
├─nvme0n1p1 259:1    0   512M  0 part /boot/efi
└─nvme0n1p2 259:2    0 476,4G  0 part /gnu/store
                                      /usr/local
                                      /srv
                                      /opt
                                      /home
                                      /gnu
                                      /boot/writable
                                      /boot/grub2/x86_64-efi
                                      /boot/grub2/i386-pc
                                      /.snapshots
                                      /var
                                      /root
                                      /

#+END_SRC
In this instance, the system partition is labeled as ~nvme0n1p2~, but yours might be different, so write it down as you'll soon need it!

We'll need to create the actual subvolume now:
#+BEGIN_SRC sh
  sudo -i # We'll log in as root for the rest of the process
  mkdir /var/mnt
  mount /dev/nvme0n1p2 /var/mnt -o subvolid=0 # use your parition name instead
  btrfs subvolume create /var/mnt/@/gnu
  umount /var/mnt
#+END_SRC

Next up we need to create the mountpoint for the subvolume.
#+BEGIN_SRC sh
  transactional-update shell # enter the shell
  mkdir /gnu 
  exit # exit the shell, we are now back to our host root user
  exit # and we log out of the root account
#+END_SRC

Now reboot your computer. *This part is important - not rebooting now will cause issues later.*

*The ~/gnu~ directory should exist now.* (If it doesn't it becomes impossible to proceed further, so make sure it's there!)

