README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-14 Ne 20:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Installing Guix on openSUSE MicroOS</title>
<meta name="author" content="(λ () nil)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Installing Guix on openSUSE MicroOS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05f1207">1. Introduction</a></li>
<li><a href="#org8efa6dd">2. Notes</a></li>
<li><a href="#org1569d2a">3. Installation</a>
<ul>
<li><a href="#org17a2ee9">3.1. Prepare subvolume</a></li>
<li><a href="#orgbeff66e">3.2. Mount subvolume</a></li>
<li><a href="#orgcdb7ad2">3.3. Putting the Guix files into place</a>
<ul>
<li><a href="#org252ede4">3.3.1. Downloading the tarball</a></li>
<li><a href="#org0e7e6bd">3.3.2. Extract and install the files</a></li>
<li><a href="#orgf5953dd">3.3.3. Set up the environment</a></li>
<li><a href="#orgafeb01f">3.3.4. Add the build users and groups</a></li>
<li><a href="#org3ec5798">3.3.5. Install and enable the services</a></li>
<li><a href="#org3a39a7d">3.3.6. Systemwide binary installation</a></li>
<li><a href="#orgb10ccaf">3.3.7. Enabling substitutes</a></li>
</ul>
</li>
<li><a href="#org88f3f79">3.4. Setting the SELinux policy</a></li>
<li><a href="#org090f728">3.5. Network fix</a></li>
<li><a href="#org6db4ba1">3.6. Finishing touches</a></li>
</ul>
</li>
<li><a href="#org579dbbe">4. Conclusion</a></li>
</ul>
</div>
</div>
<p>
<a href="https://raw.githack.com/CuBeRJAN/microos-guix/main/README.html">Click here for the HTML version</a>
</p>

<div id="outline-container-org05f1207" class="outline-2">
<h2 id="org05f1207"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I have recently decided to move my desktop to an immutable system, more specifically openSUSE's MicroOS.
</p>

<p>
Since MicroOS doesn't use a traditional package manager like <code>apt</code> or <code>zypper</code>, it's necessary to use containerised or otherwise distribution-independent solutions for installing packages.
The usual approach is using <code>flatpak</code> for GUI applications, and <code>distrobox</code> to create containers for CLI utilities and wherever else it is needed.
</p>

<p>
I personally have multiple issues with using containers:
</p>
<ul class="org-ul">
<li>They aren't transactionally updated - my containerized system can still break and cause trouble, even if limited just to the container this is still troublesome in my opinion.</li>
<li>The tooling is somewhat lacking in my opinion - for example exporting binaries from a container is a little awkward.</li>
</ul>

<p>
The solution? <a href="https://guix.gnu.org/">Guix</a>.
</p>

<p>
Guix allows for easy installations of software on MicroOS - there is little difference in usage compared to, say, <code>apt</code>.
</p>

<p>
However, using Guix on MicroOS has proven itself a difficult task - so I've decided to outline the steps for anyone looking to do the same.
</p>
</div>
</div>

<div id="outline-container-org8efa6dd" class="outline-2">
<h2 id="org8efa6dd"><span class="section-number-2">2.</span> Notes</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Unfortunately it is currently not possible to use Guix with SELinux - for that reason SELinux will be set to <code>permissive</code> mode. This has certain security implications - I'm not a security expert so you are free to do your own research for what these are.
<ul class="org-ul">
<li>I'll say that from what I've seen the general consensus seems that using <code>permissive</code> is <i>acceptable</i> on a desktop.</li>
</ul></li>
<li>I know Nix can be used for the same purpose, but I personally prefer Guix and have more experience with it.</li>
</ul>
</div>
</div>

<div id="outline-container-org1569d2a" class="outline-2">
<h2 id="org1569d2a"><span class="section-number-2">3.</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<p>
Let's get into the actual installation steps.
</p>
</div>

<div id="outline-container-org17a2ee9" class="outline-3">
<h3 id="org17a2ee9"><span class="section-number-3">3.1.</span> Prepare subvolume</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We will first need to create a <code>btrfs</code> subvolume for the <code>/gnu</code> directory. First let's find the system drive's name - this can be done using the command <code>lsblk</code>.
</p>

<p>
Here is an example of what the output of this command can look like:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">nvme0n1</span>     259:0    0 476,9G  0 disk 
<span style="color: #006DAF;">&#9500;&#9472;nvme0n1p1</span> 259:1    0   512M  0 part /boot/efi
<span style="color: #006DAF;">&#9492;&#9472;nvme0n1p2</span> 259:2    0 476,4G  0 part /gnu/store
                                      <span style="color: #006DAF;">/usr/local</span>
                                      <span style="color: #006DAF;">/srv</span>
                                      <span style="color: #006DAF;">/opt</span>
                                      <span style="color: #006DAF;">/home</span>
                                      <span style="color: #006DAF;">/gnu</span>
                                      <span style="color: #006DAF;">/boot/writable</span>
                                      <span style="color: #006DAF;">/boot/grub2/x86_64-efi</span>
                                      <span style="color: #006DAF;">/boot/grub2/i386-pc</span>
                                      <span style="color: #006DAF;">/.snapshots</span>
                                      <span style="color: #006DAF;">/var</span>
                                      <span style="color: #006DAF;">/root</span>
                                      <span style="color: #006DAF;">/</span>

</pre>
</div>
<p>
In this instance, the system partition is labeled as <code>nvme0n1p2</code>, but yours might be different, so write it down as you'll soon need it!
</p>

<p>
We'll need to create the actual subvolume now:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> <span style="color: #D0372D;">-i</span> <span style="color: #8D8D84; font-style: italic;"># We'll log in as root for the rest of the process</span>
<span style="color: #006DAF;">mkdir</span> /var/mnt
<span style="color: #006DAF;">mount</span> /dev/nvme0n1p2 /var/mnt <span style="color: #D0372D;">-o</span> subvolid=0 <span style="color: #8D8D84; font-style: italic;"># use your parition name instead</span>
<span style="color: #006DAF;">btrfs</span> subvolume create /var/mnt/@/gnu
<span style="color: #006DAF;">umount</span> /var/mnt
</pre>
</div>

<p>
Next up we need to create the mountpoint for the subvolume.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">transactional-update</span> shell <span style="color: #8D8D84; font-style: italic;"># enter the shell</span>
<span style="color: #006DAF;">mkdir</span> /gnu 
<span style="color: #006DAF;">exit</span> <span style="color: #8D8D84; font-style: italic;"># exit the shell, we are now back to our host root user</span>
<span style="color: #006DAF;">exit</span> <span style="color: #8D8D84; font-style: italic;"># and we log out of the root account</span>
</pre>
</div>

<p>
Now reboot your computer. <b>This part is important - not rebooting now will cause issues later.</b>
</p>

<p>
<b>The <code>/gnu</code> directory should exist now.</b> (If it doesn't it becomes impossible to proceed further, so make sure it's there!)
</p>
</div>
</div>
