README.org
** Mount subvolume
Now that we have created the subvolume successfully we need to automatically mount it.

Open up the file ~/etc/fstab~ in your editor of choice - ~nano~ will suffice.

#+BEGIN_SRC sh
  sudo -i
  nano /etc/fstab
#+END_SRC

Now you'll see something like this:

#+BEGIN_SRC conf-space
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe / btrfs ro 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /var btrfs subvol=/@/var,x-initrd.mount 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /usr/local btrfs subvol=/@/usr/local 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /srv btrfs subvol=/@/srv 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /root btrfs subvol=/@/root,x-initrd.mount 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /opt btrfs subvol=/@/opt 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /home btrfs subvol=/@/home 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /boot/writable btrfs subvol=/@/boot/writable 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /boot/grub2/x86_64-efi btrfs subvol=/@/boot/grub2/x86_64-efi 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /boot/grub2/i386-pc btrfs subvol=/@/boot/grub2/i386-pc 0 0
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /.snapshots btrfs subvol=/@/.snapshots 0 0
  UUID=9832-F680 /boot/efi vfat utf8 0 2
  overlay /etc overlay defaults,lowerdir=/sysroot/var/lib/overlay/3/etc:/sysroot/etc,upperdir=/sysroot/var/lib/overlay/4/etc,workdir=/sysroot/var/lib/overlay/4/work-etc,x-systemd.requires-mounts-for=/var,x-systemd.requires-mounts-for=/sysroot/var,x-initrd.mount 0 0
#+END_SRC

Take note of the ~UUID~ used for the ~/~ system (that's the one at the top of the file). We'll now add another line to the bottom of this file.

#+BEGIN_SRC conf-space
  UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe /gnu btrfs subvol=/@/gnu 0 0 # if you copy-paste make sure to replace the UUID here!
#+END_SRC

Save the file, exit and yet again *reboot* (the reboot here isn't optional!).

Finally once we reboot we can verify everything is mounted correctly:
#+BEGIN_SRC sh
  mount | grep gnu
#+END_SRC

And the output should be something similar to this:

#+BEGIN_SRC sh
  /dev/nvme0n1p2 on /gnu type btrfs (rw,relatime,seclabel,ssd,discard=async,space_cache=v2,subvolid=269,subvol=/@/gnu)
#+END_SRC

If everything is correct, we can move on to the next step.

** Putting the Guix files into place
We can now actually install Guix into the system. The steps we are about to take are mostly copied from [[https://guix.gnu.org/manual/en/html_node/Binary-Installation.html][here]] but there are some minor changes.

*An important note here is that the URLs might change with new Guix releases, so check you are grabbing the latest version!*

*** Downloading the tarball
First we download the Guix tarball. 
#+BEGIN_SRC sh
  sudo -i # log in as root
  cd /tmp
  wget "https://ftp.gnu.org/gnu/guix/guix-binary-1.4.0.x86_64-linux.tar.xz" # download the Guix binary
#+END_SRC

Now we verify its signature
#+BEGIN_SRC sh
  wget "https://ftp.gnu.org/gnu/guix/guix-binary-1.4.0.x86_64-linux.tar.xz.sig" # download the signature
  wget 'https://sv.gnu.org/people/viewgpg.php?user_id=15145' -qO - | gpg --import - # import signature
  gpg --verify guix-binary-1.4.0.x86_64-linux.tar.xz.sig # and finally verify the file
#+END_SRC

If the command shows no issues, we have succesfully downloaded Guix.
*Take note that a warning like “This key is not certified with a trusted signature!” is normal.*

*** Extract and install the files
We can continue the installation process - make sure you are still logged in as root!
#+BEGIN_SRC sh
  tar --warning=no-timestamp -xf /tmp/guix-binary-1.4.0.x86_64-linux.tar.xz
  mv var/guix /var/
  mv gnu/store /gnu/
#+END_SRC

I also like to disable copy-on-write for the ~/gnu~ directory as it isn't necessary there, this should also help improve speed.
#+BEGIN_SRC sh
  chattr +C -R /gnu
#+END_SRC

*** Set up the environment
#+BEGIN_SRC sh
  mkdir -p ~root/.config/guix
  ln -sf /var/guix/profiles/per-user/root/current-guix ~root/.config/guix/current

  export GUIX_PROFILE="`echo ~root`/.config/guix/current" 
  source $GUIX_PROFILE/etc/profile
#+END_SRC

*** Add the build users and groups
#+BEGIN_SRC sh
  groupadd --system guixbuild # create the group
#+END_SRC

*This command spans multiple lines, make sure to copy it in its entirety!*
#+BEGIN_SRC sh
  for i in $(seq -w 1 10); # and now create the users
  do
    useradd -g guixbuild -G guixbuild           \
	    -d /var/empty -s $(which nologin)     \
	    -c "Guix build user $i" --system    \
	    guixbuilder$i;
  done
#+END_SRC

