README.html

<div id="outline-container-orgbeff66e" class="outline-3">
<h3 id="orgbeff66e"><span class="section-number-3">3.2.</span> Mount subvolume</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Now that we have created the subvolume successfully we need to automatically mount it.
</p>

<p>
Open up the file <code>/etc/fstab</code> in your editor of choice - <code>nano</code> will suffice.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> <span style="color: #D0372D;">-i</span>
<span style="color: #006DAF;">nano</span> /etc/fstab
</pre>
</div>

<p>
Now you'll see something like this:
</p>

<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> / btrfs ro 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /var btrfs subvol=/@/var,x-initrd.mount 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /usr/local btrfs subvol=/@/usr/local 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /srv btrfs subvol=/@/srv 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /root btrfs subvol=/@/root,x-initrd.mount 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /opt btrfs subvol=/@/opt 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /home btrfs subvol=/@/home 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /boot/writable btrfs subvol=/@/boot/writable 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /boot/grub2/x86_64-efi btrfs subvol=/@/boot/grub2/x86_64-efi 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /boot/grub2/i386-pc btrfs subvol=/@/boot/grub2/i386-pc 0 0
<span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /.snapshots btrfs subvol=/@/.snapshots 0 0
<span style="color: #BA36A5;">UUID=9832-F680</span> /boot/efi vfat utf8 0 2
<span style="color: #BA36A5;">overlay</span> /etc overlay defaults,lowerdir=/sysroot/var/lib/overlay/3/etc:/sysroot/etc,upperdir=/sysroot/var/lib/overlay/4/etc,workdir=/sysroot/var/lib/overlay/4/work-etc,x-systemd.requires-mounts-for=/var,x-systemd.requires-mounts-for=/sysroot/var,x-initrd.mount 0 0
</pre>
</div>

<p>
Take note of the <code>UUID</code> used for the <code>/</code> system (that's the one at the top of the file). We'll now add another line to the bottom of this file.
</p>

<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #BA36A5;">UUID=5805f3d4-7a45-435b-bcb4-234ce42633fe</span> /gnu btrfs subvol=/@/gnu 0 0 <span style="color: #8D8D84; font-style: italic;"># </span><span style="color: #8D8D84; font-style: italic;">if you copy-paste make sure to replace the UUID here!</span>
</pre>
</div>

<p>
Save the file, exit and yet again <b>reboot</b> (the reboot here isn't optional!).
</p>

<p>
Finally once we reboot we can verify everything is mounted correctly:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">mount</span> <span style="color: #0000FF;">|</span> <span style="color: #006DAF;">grep</span> gnu
</pre>
</div>

<p>
And the output should be something similar to this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">/dev/nvme0n1p2</span> on /gnu type btrfs <span style="color: #707183;">(</span><span style="color: #006DAF;">rw,relatime,seclabel,ssd,discard=async,space_cache=v2,subvolid=269,subvol=/@/gnu</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
If everything is correct, we can move on to the next step.
</p>
</div>
</div>

<div id="outline-container-orgcdb7ad2" class="outline-3">
<h3 id="orgcdb7ad2"><span class="section-number-3">3.3.</span> Putting the Guix files into place</h3>
<div class="outline-text-3" id="text-3-3">
<p>
We can now actually install Guix into the system. The steps we are about to take are mostly copied from <a href="https://guix.gnu.org/manual/en/html_node/Binary-Installation.html">here</a> but there are some minor changes.
</p>

<p>
<b>An important note here is that the URLs might change with new Guix releases, so check you are grabbing the latest version!</b>
</p>
</div>

<div id="outline-container-org252ede4" class="outline-4">
<h4 id="org252ede4"><span class="section-number-4">3.3.1.</span> Downloading the tarball</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
First we download the Guix tarball. 
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> <span style="color: #D0372D;">-i</span> <span style="color: #8D8D84; font-style: italic;"># log in as root</span>
<span style="color: #006FE0;">cd</span> /tmp
<span style="color: #006DAF;">wget</span> <span style="color: #008000;">"https://ftp.gnu.org/gnu/guix/guix-binary-1.4.0.x86_64-linux.tar.xz"</span> <span style="color: #8D8D84; font-style: italic;"># download the Guix binary</span>
</pre>
</div>

<p>
Now we verify its signature
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">wget</span> <span style="color: #008000;">"https://ftp.gnu.org/gnu/guix/guix-binary-1.4.0.x86_64-linux.tar.xz.sig"</span> <span style="color: #8D8D84; font-style: italic;"># download the signature</span>
<span style="color: #006DAF;">wget</span> <span style="color: #008000;">'https://sv.gnu.org/people/viewgpg.php?user_id=15145'</span> <span style="color: #D0372D;">-qO</span> <span style="color: #D0372D;">-</span> <span style="color: #0000FF;">|</span> <span style="color: #006DAF;">gpg</span> <span style="color: #D0372D;">--import</span> <span style="color: #D0372D;">-</span> <span style="color: #8D8D84; font-style: italic;"># import signature</span>
<span style="color: #006DAF;">gpg</span> <span style="color: #D0372D;">--verify</span> guix-binary-1.4.0.x86_64-linux.tar.xz.sig <span style="color: #8D8D84; font-style: italic;"># and finally verify the file</span>
</pre>
</div>

<p>
If the command shows no issues, we have succesfully downloaded Guix.
<b>Take note that a warning like “This key is not certified with a trusted signature!” is normal.</b>
</p>
</div>
</div>

<div id="outline-container-org0e7e6bd" class="outline-4">
<h4 id="org0e7e6bd"><span class="section-number-4">3.3.2.</span> Extract and install the files</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
We can continue the installation process - make sure you are still logged in as root!
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">tar</span> <span style="color: #808080; font-weight: bold;">--warning=no-timestamp</span> <span style="color: #D0372D;">-xf</span> /tmp/guix-binary-1.4.0.x86_64-linux.tar.xz
<span style="color: #006DAF;">mv</span> var/guix /var/
<span style="color: #006DAF;">mv</span> gnu/store /gnu/
</pre>
</div>

<p>
I also like to disable copy-on-write for the <code>/gnu</code> directory as it isn't necessary there, this should also help improve speed.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">chattr</span> +C <span style="color: #D0372D;">-R</span> /gnu
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5953dd" class="outline-4">
<h4 id="orgf5953dd"><span class="section-number-4">3.3.3.</span> Set up the environment</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">mkdir</span> <span style="color: #D0372D;">-p</span> ~root/.config/guix
<span style="color: #006DAF;">ln</span> <span style="color: #D0372D;">-sf</span> /var/guix/profiles/per-user/root/current-guix ~root/.config/guix/current

<span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">GUIX_PROFILE</span>=<span style="color: #008000;">"</span><span style="color: #008000;">`</span><span style="color: #006FE0; background-color: #FFFFFF;">echo</span><span style="color: #008000; background-color: #FFFFFF;"> ~root</span><span style="color: #008000;">`</span><span style="color: #008000;">/.config/guix/current"</span> 
<span style="color: #006FE0;">source</span> <span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">GUIX_PROFILE</span>/etc/profile
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafeb01f" class="outline-4">
<h4 id="orgafeb01f"><span class="section-number-4">3.3.4.</span> Add the build users and groups</h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">groupadd</span> <span style="color: #D0372D;">--system</span> guixbuild <span style="color: #8D8D84; font-style: italic;"># create the group</span>
</pre>
</div>

<p>
<b>This command spans multiple lines, make sure to copy it in its entirety!</b>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #0000FF;">for</span> <span style="color: #D0372D; font-style: italic;">i</span> <span style="color: #0000FF;">in</span> <span style="color: #0000FF;">$</span><span style="color: #707183;">(</span><span style="color: #006DAF; background-color: #FFFFFF;">seq</span><span style="color: #333333; background-color: #FFFFFF;"> </span><span style="color: #D0372D; background-color: #FFFFFF;">-w</span><span style="color: #333333; background-color: #FFFFFF;"> 1 10</span><span style="color: #707183;">)</span><span style="color: #0000FF;">;</span> <span style="color: #8D8D84; font-style: italic;"># and now create the users</span>
<span style="color: #0000FF;">do</span>
  <span style="color: #006DAF;">useradd</span> <span style="color: #D0372D;">-g</span> guixbuild <span style="color: #D0372D;">-G</span> guixbuild           \
          <span style="color: #D0372D;">-d</span> /var/empty <span style="color: #D0372D;">-s</span> <span style="color: #0000FF;">$</span><span style="color: #707183;">(</span><span style="color: #006DAF; background-color: #FFFFFF;">which</span><span style="color: #333333; background-color: #FFFFFF;"> nologin</span><span style="color: #707183;">)</span>     \
          <span style="color: #D0372D;">-c</span> <span style="color: #008000;">"Guix build user </span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">i</span><span style="color: #008000;">"</span> <span style="color: #D0372D;">--system</span>    \
          guixbuilder<span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">i</span><span style="color: #0000FF;">;</span>
<span style="color: #0000FF;">done</span>
</pre>
</div>
</div>
</div>
