README.org
*** Install and enable the services
First we copy the services in the necessary location, then we enable them.
#+BEGIN_SRC sh
  cp ~root/.config/guix/current/lib/systemd/system/gnu-store.mount ~root/.config/guix/current/lib/systemd/system/guix-daemon.service /etc/systemd/system/
  systemctl enable gnu-store.mount guix-daemon
#+END_SRC

*** Systemwide binary installation
At this point we can make the binary available for all users of the system.
#+BEGIN_SRC sh
  mkdir -p /usr/local/bin
  cd /usr/local/bin
  ln -s /var/guix/profiles/per-user/root/current-guix/bin/guix
#+END_SRC

It is also a good idea to make the manual available:
#+BEGIN_SRC sh
  mkdir -p /usr/local/share/info
  cd /usr/local/share/info
  for i in /var/guix/profiles/per-user/root/current-guix/share/info/* ; do ln -s $i ; done
#+END_SRC

*** Enabling substitutes
Binary substitutes allow us to avoid building packages locally, (see the [[https://guix.gnu.org/manual/en/html_node/Substitutes.html][official documentation]])

#+BEGIN_SRC sh
  guix archive --authorize < ~root/.config/guix/current/share/guix/ci.guix.gnu.org.pub
  guix archive --authorize < ~root/.config/guix/current/share/guix/bordeaux.guix.gnu.org.pub
#+END_SRC

** Setting the SELinux policy
We are almost there, but Guix isn't quite functional yet. To disable SELinux we need to edit a kernel boot parameter.

Open the file ~/etc/default/grub~ with your favorite editor.

#+BEGIN_SRC sh
  sudo nano /etc/default/grub
#+END_SRC

You should be able to find a line that looks like this:
#+BEGIN_SRC conf-space
  GRUB_CMDLINE_LINUX_DEFAULT="splash=silent swapaccount=1 mitigations=auto quiet security=selinux selinux=1 enforcing=1"
#+END_SRC
Here change the ~enforcing~ variable to 0.
#+BEGIN_SRC conf-space
  GRUB_CMDLINE_LINUX_DEFAULT="splash=silent swapaccount=1 mitigations=auto quiet security=selinux selinux=1 enforcing=0"
#+END_SRC
Save the file and exit.

Now we have to regenerate the grub configuration:

#+BEGIN_SRC sh
  sudo transactional-update grub.cfg
#+END_SRC

*Reboot after this step!*

After the reboot verify the status of the Guix daemon.

#+BEGIN_SRC sh
  systemctl status guix-daemon
#+END_SRC

If everything is okay we have successfully set up Guix!

** Network fix
At this point I'll also mention that Guix requires the ~/etc/services~ file, which currently doesn't exist by default on MicroOS.

We can easily fix this:
#+BEGIN_SRC sh
  sudo ln -s /usr/etc/services /etc/services
#+END_SRC

** Finishing touches
Finally we need to configure the Guix application environment.

This is described in the [[https://guix.gnu.org/manual/en/html_node/Application-Setup.html][Guix documentation]], but here's my quick summary:

First update our local guix profile, run this as your user:
#+BEGIN_SRC sh
  guix pull
#+END_SRC
This might take a little while.

Next open up the ~$HOME/.bash_profile~ file, this time as your regular user. Then fill it in like so:
#+BEGIN_SRC sh
  if [ -f ~/.bashrc ]; then . ~/.bashrc; fi

  if [ ! -f /.dockerenv ] && [ ! -f /run/.containerenv ]; then
      export GUIX_PROFILE="$HOME/.guix-profile"
      export GUIX_LOCPATH="$HOME/.guix-profile/lib/locale"
      export PATH="$HOME/.config/guix/current/bin:$PATH"
      export SSL_CERT_DIR="$HOME/.guix-profile/etc/ssl/certs"
      export SSL_CERT_FILE="$HOME/.guix-profile/etc/ssl/certs/ca-certificates.crt"
      export GIT_SSL_CAINFO="$SSL_CERT_FILE"
      . "$GUIX_PROFILE/etc/profile"
  fi  
#+END_SRC

Now log out and back in for these changes to take effect. Finally we can install the most essential Guix packages:
#+BEGIN_SRC sh
  guix install glibc-locales nss-certs
#+END_SRC

* Conclusion
With these steps you should be able to successfully set up Guix on MicroOS. If you find any broken steps or other problems, please post on the [[https://github.com/CuBeRJAN/microos-guix/issues][issues page]].


