README.html

<div id="outline-container-org3ec5798" class="outline-4">
<h4 id="org3ec5798"><span class="section-number-4">3.3.5.</span> Install and enable the services</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
First we copy the services in the necessary location, then we enable them.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">cp</span> ~root/.config/guix/current/lib/systemd/system/gnu-store.mount ~root/.config/guix/current/lib/systemd/system/guix-daemon.service /etc/systemd/system/
<span style="color: #006DAF;">systemctl</span> enable gnu-store.mount guix-daemon
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a39a7d" class="outline-4">
<h4 id="org3a39a7d"><span class="section-number-4">3.3.6.</span> Systemwide binary installation</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
At this point we can make the binary available for all users of the system.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">mkdir</span> <span style="color: #D0372D;">-p</span> /usr/local/bin
<span style="color: #006FE0;">cd</span> /usr/local/bin
<span style="color: #006DAF;">ln</span> <span style="color: #D0372D;">-s</span> /var/guix/profiles/per-user/root/current-guix/bin/guix
</pre>
</div>

<p>
It is also a good idea to make the manual available:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">mkdir</span> <span style="color: #D0372D;">-p</span> /usr/local/share/info
<span style="color: #006FE0;">cd</span> /usr/local/share/info
<span style="color: #0000FF;">for</span> <span style="color: #D0372D; font-style: italic;">i</span> <span style="color: #0000FF;">in</span> /var/guix/profiles/per-user/root/current-guix/share/info/* <span style="color: #0000FF;">;</span> <span style="color: #0000FF;">do</span> <span style="color: #006DAF;">ln</span> <span style="color: #D0372D;">-s</span> <span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">i</span> <span style="color: #0000FF;">;</span> <span style="color: #0000FF;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb10ccaf" class="outline-4">
<h4 id="orgb10ccaf"><span class="section-number-4">3.3.7.</span> Enabling substitutes</h4>
<div class="outline-text-4" id="text-3-3-7">
<p>
Binary substitutes allow us to avoid building packages locally, (see the <a href="https://guix.gnu.org/manual/en/html_node/Substitutes.html">official documentation</a>)
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">guix</span> archive <span style="color: #D0372D;">--authorize</span> <span style="color: #0000FF;">&lt;</span> ~root/.config/guix/current/share/guix/ci.guix.gnu.org.pub
<span style="color: #006DAF;">guix</span> archive <span style="color: #D0372D;">--authorize</span> <span style="color: #0000FF;">&lt;</span> ~root/.config/guix/current/share/guix/bordeaux.guix.gnu.org.pub
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org88f3f79" class="outline-3">
<h3 id="org88f3f79"><span class="section-number-3">3.4.</span> Setting the SELinux policy</h3>
<div class="outline-text-3" id="text-3-4">
<p>
We are almost there, but Guix isn't quite functional yet. To disable SELinux we need to edit a kernel boot parameter.
</p>

<p>
Open the file <code>/etc/default/grub</code> with your favorite editor.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> nano /etc/default/grub
</pre>
</div>

<p>
You should be able to find a line that looks like this:
</p>
<div class="org-src-container">
<pre class="src src-conf-space">GRUB_CMDLINE_LINUX_DEFAULT=<span style="color: #008000;">"splash=silent swapaccount=1 mitigations=auto quiet security=selinux selinux=1 enforcing=1"</span>
</pre>
</div>
<p>
Here change the <code>enforcing</code> variable to 0.
</p>
<div class="org-src-container">
<pre class="src src-conf-space">GRUB_CMDLINE_LINUX_DEFAULT=<span style="color: #008000;">"splash=silent swapaccount=1 mitigations=auto quiet security=selinux selinux=1 enforcing=0"</span>
</pre>
</div>
<p>
Save the file and exit.
</p>

<p>
Now we have to regenerate the grub configuration:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> transactional-update grub.cfg
</pre>
</div>

<p>
<b>Reboot after this step!</b>
</p>

<p>
After the reboot verify the status of the Guix daemon.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">systemctl</span> status guix-daemon
</pre>
</div>

<p>
If everything is okay we have successfully set up Guix!
</p>
</div>
</div>

<div id="outline-container-org090f728" class="outline-3">
<h3 id="org090f728"><span class="section-number-3">3.5.</span> Network fix</h3>
<div class="outline-text-3" id="text-3-5">
<p>
At this point I'll also mention that Guix requires the <code>/etc/services</code> file, which currently doesn't exist by default on MicroOS.
</p>

<p>
We can easily fix this:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">sudo</span> ln <span style="color: #D0372D;">-s</span> /usr/etc/services /etc/services
</pre>
</div>
</div>
</div>

<div id="outline-container-org6db4ba1" class="outline-3">
<h3 id="org6db4ba1"><span class="section-number-3">3.6.</span> Finishing touches</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Finally we need to configure the Guix application environment.
</p>

<p>
This is described in the <a href="https://guix.gnu.org/manual/en/html_node/Application-Setup.html">Guix documentation</a>, but here's my quick summary:
</p>

<p>
First update our local guix profile, run this as your user:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">guix</span> pull
</pre>
</div>
<p>
This might take a little while.
</p>

<p>
Next open up the <code>$HOME/.bash_profile</code> file, this time as your regular user. Then fill it in like so:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #0000FF;">if</span> <span style="color: #707183;">[</span> -f ~/.bashrc <span style="color: #707183;">]</span><span style="color: #0000FF;">;</span> <span style="color: #0000FF;">then</span> <span style="color: #006DAF;">.</span> ~/.bashrc<span style="color: #0000FF;">;</span> <span style="color: #0000FF;">fi</span>

<span style="color: #0000FF;">if</span> <span style="color: #707183;">[</span> ! -f /.dockerenv <span style="color: #707183;">]</span> <span style="color: #0000FF;">&amp;&amp;</span> <span style="color: #707183;">[</span> ! -f /run/.containerenv <span style="color: #707183;">]</span><span style="color: #0000FF;">;</span> <span style="color: #0000FF;">then</span>
    <span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">GUIX_PROFILE</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span><span style="color: #008000;">/.guix-profile"</span>
    <span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">GUIX_LOCPATH</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span><span style="color: #008000;">/.guix-profile/lib/locale"</span>
    <span style="color: #0000FF;">export</span> <span style="color: #ff0000; font-weight: bold; font-style: italic;">PATH</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span><span style="color: #008000;">/.config/guix/current/bin:</span><span style="color: #0000FF;">$</span><span style="color: #ff0000; font-weight: bold; font-style: italic;">PATH</span><span style="color: #008000;">"</span>
    <span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">SSL_CERT_DIR</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span><span style="color: #008000;">/.guix-profile/etc/ssl/certs"</span>
    <span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">SSL_CERT_FILE</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span><span style="color: #008000;">/.guix-profile/etc/ssl/certs/ca-certificates.crt"</span>
    <span style="color: #0000FF;">export</span> <span style="color: #BA36A5; font-style: italic;">GIT_SSL_CAINFO</span>=<span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">SSL_CERT_FILE</span><span style="color: #008000;">"</span>
    <span style="color: #006DAF;">.</span> <span style="color: #008000;">"</span><span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">GUIX_PROFILE</span><span style="color: #008000;">/etc/profile"</span>
<span style="color: #0000FF;">fi</span>  
</pre>
</div>

<p>
Now log out and back in for these changes to take effect. Finally we can install the most essential Guix packages:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #006DAF;">guix</span> install glibc-locales nss-certs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org579dbbe" class="outline-2">
<h2 id="org579dbbe"><span class="section-number-2">4.</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
With these steps you should be able to successfully set up Guix on MicroOS. If you find any broken steps or other problems, please post on the <a href="https://github.com/CuBeRJAN/microos-guix/issues">issues page</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: (λ () nil)</p>
<p class="date">Created: 2023-05-14 Ne 20:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
